public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}

//Допустим, у нас есть магазин. В нашем магазине есть товары трёх категорий: продукты,
// электроника(мобильные телефоны и ноутбуки), одежда. У каждого товара есть цена и наименование .
// Каждый товар можно купить (покупателю выставляется счет).
//        при покупки продуктов выставляется дополнительная цена за срочность доставки.
//        при покупке электроники, покупателю оформляют гарантию
//        (т.е. при покупке должен выполнятся метод “Оформить гарантию”)
//        телефоны продаются только с контрактом оператора
//        (т.е. при покупке должен выполнятся метод “Оформить контракт”)
//        Необходимо создать соответствующую структуру классов метод покупки товара
